app/controllers/user_account_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show_user
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "updated_at", "username", "is_admin", "password", "email") VALUES('foo bar', '2010-07-23 20:16:31', '2010-07-23 20:16:31', 'foo', 't', NULL, 'foo@bar.blah')
---
  def create
    @user = User.new(params[:user])

    if @user.save then

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def edit_user
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-07-23 20:31:22', "username" = 'foo' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "id" = 2
---
  def delete_user
    User.destroy params[:id]

SELECT "feed_sources".id FROM "feed_sources" WHERE ("feed_sources"."link" = 'sss' AND "feed_sources".id <> 3) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 4)
SELECT "users".id FROM "users" INNER JOIN "feed_sources_users" ON "users".id = "feed_sources_users".user_id WHERE ("users"."id" = 1) AND ("feed_sources_users".feed_source_id = NULL ) LIMIT 1
INSERT INTO "feed_sources" ("name", "created_at", "updated_at", "last_updated", "link", "ico") VALUES('hbcbhbhshb', '2010-07-24 19:39:54', '2010-07-24 19:39:54', '2010-07-24 19:39:54', 'meiobit', 'ssjjsdhjdshdshj')
---
  def add_feed_to_user
    feed_sources = FeedSource.find(:all, :conditions => { :link => params[:feed_source][:link] })

    if feed_sources.empty?
      @feed_source = FeedSource.new(params[:feed_source])
      @feed_source.last_updated = Time.now
    else
      @feed_source = feed_sources.first
    end

    @user = User.find( params[:id] )
    unless @feed_source.users.include? @user
      @feed_source.users << @user

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "feed_sources" WHERE ("feed_sources"."id" = 1)
DELETE FROM "feed_sources" WHERE "id" = 2
SELECT * FROM "users" INNER JOIN "feed_sources_users" ON "users".id = "feed_sources_users".user_id WHERE ("feed_sources_users".feed_source_id = 2 )
---
  def delete_feed_source
    @user = User.find(params[:user_id])
    @feed_source = FeedSource.find(params[:feed_source_id])
    @user.feed_sources.delete(@feed_source)
    if @feed_source.users.empty?